# DataFrame 2
- Conditional Selection in dataframe
- Operator | and & for conditional stateemnt between series
- add  column df['new'] = random_list\
- reset_index() to a numerical index
- set+index('NewIndex')
- to get the change make sure to set inplace = True

In [4]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [5]:
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,5), ['A','B','C','D','E'], ['W','X','Y','Z','G'])
df

          W         X         Y         Z         G
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846 -0.610259

# Conditional Selection

In [8]:
df > 0 # simmilar to numpy array

       W      X      Y      Z      G
A   True   True   True   True   True
B   True   True  False  False  False
C   True  False   True   True   True
D  False   True  False   True   True
E  False  False   True   True  False

######  geting NaNs when perform operation on whole dataframe

In [10]:
booldf = df> 0
df[booldf]
#True and Null(NaNs) in this case False

          W         X         Y         Z         G
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646       NaN       NaN       NaN
C  0.484752       NaN  1.901755  0.238127  1.996652
D       NaN  0.196800       NaN  0.000366  1.025984
E       NaN       NaN  0.649826  2.154846       NaN

In [11]:
df[df>0] #not common,

          W         X         Y         Z         G
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646       NaN       NaN       NaN
C  0.484752       NaN  1.901755  0.238127  1.996652
D       NaN  0.196800       NaN  0.000366  1.025984
E       NaN       NaN  0.649826  2.154846       NaN

###### - Not Showing NaNs when doing df[df['W']>0]

In [14]:
df['W'] > 0

A     True
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [15]:
df[df['W']> 0]

          W         X         Y         Z         G
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652

In [27]:
df[df['Z'] <0]

          W         X         Y        Z         G
B  0.638787  0.329646 -0.497104 -0.75407 -0.943406

In [28]:
resultdf = df[df['Z']>0]
resultdf
# breaking down the step will cause memory issue due tovaraible3

          W         X         Y         Z         G
A  0.390528  0.166905  0.184502  0.807706  0.072960
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846 -0.610259

In [29]:
resultdf['X']

A    0.166905
C   -0.116773
D    0.196800
E   -0.031579
Name: X, dtype: float64

In [30]:
df[df['W']>0][['X','Y']]
#check row in column W > 0, (1)
# Get ROWS and Columns that is True to (1)
# Select only column X, Y

          X         Y
A  0.166905  0.184502
B  0.329646 -0.497104
C -0.116773  1.901755

# Multiple Condition

In [31]:
df[(df['W']>0) and (df['Y'])> 1]
#alueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().
#can compare series of boolean to series of boolean
# and can only compare single meaning True vs True

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [38]:
df[(df['W']>0) or (df['Y'])> 1]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [34]:
df['W']>0

A     True
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [39]:
df['Y'] > 0

A     True
B    False
C     True
D    False
E     True
Name: Y, dtype: bool

###### To use and operation use and: & or:  |

In [40]:
df[(df['W']>0) & (df['Y']>0)]

          W         X         Y         Z         G
A  0.390528  0.166905  0.184502  0.807706  0.072960
C  0.484752 -0.116773  1.901755  0.238127  1.996652

#  Reseting Index

In [42]:
df.reset_index()
#actual index will be numerical

  index         W         X         Y         Z         G
0     A  0.390528  0.166905  0.184502  0.807706  0.072960
1     B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
2     C  0.484752 -0.116773  1.901755  0.238127  1.996652
3     D -0.993263  0.196800 -1.136645  0.000366  1.025984
4     E -0.156598 -0.031579  0.649826  2.154846 -0.610259

In [44]:
df

          W         X         Y         Z         G
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846 -0.610259

## If want to occur use reset_index(inplace = True)

In [45]:
newind = 'CA NY WY OR CO'.split()

In [46]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [50]:
df['State'] = newind #adding new column
df

          W         X         Y         Z         G State
A  0.390528  0.166905  0.184502  0.807706  0.072960    CA
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406    NY
C  0.484752 -0.116773  1.901755  0.238127  1.996652    WY
D -0.993263  0.196800 -1.136645  0.000366  1.025984    OR
E -0.156598 -0.031579  0.649826  2.154846 -0.610259    CO

## set index make sure to use Inplace = True to get the change

In [52]:
df.set_index('State')

              W         X         Y         Z         G
State
CA     0.390528  0.166905  0.184502  0.807706  0.072960
NY     0.638787  0.329646 -0.497104 -0.754070 -0.943406
WY     0.484752 -0.116773  1.901755  0.238127  1.996652
OR    -0.993263  0.196800 -1.136645  0.000366  1.025984
CO    -0.156598 -0.031579  0.649826  2.154846 -0.610259

In [53]:
df

          W         X         Y         Z         G State
A  0.390528  0.166905  0.184502  0.807706  0.072960    CA
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406    NY
C  0.484752 -0.116773  1.901755  0.238127  1.996652    WY
D -0.993263  0.196800 -1.136645  0.000366  1.025984    OR
E -0.156598 -0.031579  0.649826  2.154846 -0.610259    CO

In [54]:
df.set_index('State', inplace= True)

In [55]:
df

              W         X         Y         Z         G
State
CA     0.390528  0.166905  0.184502  0.807706  0.072960
NY     0.638787  0.329646 -0.497104 -0.754070 -0.943406
WY     0.484752 -0.116773  1.901755  0.238127  1.996652
OR    -0.993263  0.196800 -1.136645  0.000366  1.025984
CO    -0.156598 -0.031579  0.649826  2.154846 -0.610259

In [56]:
type(df['W'] > 0)

pandas.core.series.Series